Revit 2024 API
ElementSet.Insert Method
Insert the specified element into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	Element item
)
Visual Basic
Public Overridable Function Insert ( _
	item As Element _
) As Boolean
Visual C++
public:
virtual bool Insert(
	Element^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Element
The element to be inserted into the set.
Return Value
Returns whether the element was inserted into the set.
See Also
ElementSet Class
Autodesk.Revit.DB Namespace